from drug_search.bot.lexicon import MessageTemplates
from drug_search.bot.lexicon.enums import HelpSectionMode
from drug_search.bot.utils.format_message_text import DrugMessageFormatter, UserProfileMessageFormatter
from drug_search.bot.utils.funcs import format_time
from drug_search.core.lexicon.consts import (LITE_SEARCH_DAY_LIMIT, LITE_ASSISTANT_DAY_LIMIT,
                                             PREMIUM_SEARCH_DAY_LIMIT, PREMIUM_ASSISTANT_DAY_LIMIT, SEARCH_TOKENS_START,
                                             ASSISTANT_TOKENS_START, ANTISPAM_DEFAULT)


class MessageText:
    """Шаблоны сообщений"""

    class formatters:
        """Шаблоны с форматированием"""
        # [ drugs section ]
        DRUG_BRIEFLY: str = DrugMessageFormatter.format_drug_briefly
        DRUG_BY_TYPE: str = DrugMessageFormatter.format_by_type
        DRUGS_INFO: str = DrugMessageFormatter.format_drugs_info

        # [ user profile ]
        USER_PROFILE: str = UserProfileMessageFormatter.format_user_profile
        USER_PROFILE_DESCRIPTION: str = UserProfileMessageFormatter.format_user_description_profile

    class help:
        """Секция с помощью юзеру"""
        MAIN = (
            "🔎 <b>Что умеет бот?</b>\n\n"
            "Здесь ты найдешь полную инструкцию к боту\n\n"
            "Если остались вопросы, <a href='https://t.me/uaquoa'><b>напиши мне.</b></a>\n"
        )
        QUERIES = (
            "🔎 <b>Режимы</b>\n\n"
            "В боте есть <b>3 режима</b> запросов (выбираются автоматически):\n\n"
            "— Поиск препаратов: поиск препарата по названию со всеми разделами\n\n"
            "— Фарм рекомендации: рекомендации препаратов по симптомам или желаниям\n\n"
            "— Вопросы по фарме: ответы на любые вопросы фармакологического ассистента\n\n"
        )
        TOKENS = (
            "🔎 <b>Токены</b>\n\n"
            "<blockquote>"
            "Есть два типа токенов:\n"
            "1) <u>База токены</u> — расходуются на занесение препарата в базу.\n"
            "2) <u>Фарм токены</u> — нужны для ответов на вопросы и фарм рекомендаций от ассистента.\n\n"
            "</blockquote>\n\n"
            "<b>Каждый день вам начисляются токены в зависимости от вашей подписки.</b>\n\n"
            f"<b>1) Премиум:</b>\n"
            f"       — {PREMIUM_SEARCH_DAY_LIMIT} база токенов.\n"
            f"       — {PREMIUM_ASSISTANT_DAY_LIMIT} фарм токенов.\n\n"
            f"<b>2) Лайт:</b>\n"
            f"       — {LITE_SEARCH_DAY_LIMIT} база токенов.\n"
            f"       — {LITE_ASSISTANT_DAY_LIMIT} фарм токенов.\n\n"
            f"<b>3) Без подписки:</b>\n"
            f"       — <u>токены не начисляются.</u>"
        )
        SUBSCRIPTION = (
            f"🔎 <b>Система подписок</b>\n\n"
            f"<blockquote>"
            f"<u>Без подписки</u> в боте действуют ограничения:\n"
            f"       — нельзя просматривать разделы «Исследования» и «Механизм действия | Пути активации»\n"
            f"       — ограничение на частоту запросов: {ANTISPAM_DEFAULT["max_requests"]} сообщения раз в {format_time(ANTISPAM_DEFAULT["time_limit"])}\n\n"
            f"</blockquote>\n\n"
            f"<b>Какие есть подписки?</b>\n\n"
            f"1) <b><u>Лайт:</u></b>\n"
            f"      — каждый день начисляется небольшое количество токенов базы и фарм токенов\n"
            f"      — уменьшено ограничение на частоту запросов\n"
            f"      — нет доступа к изучению некоторых препаратов\n\n"
            f"2) <b><u>Премиум:</u></b>\n"
            f"      — полный доступ ко всему функционалу\n"
            f"      — каждый день вы получаете много токенов базы и фарм токенов\n"
            f"      — убраны все ограничения на частоту запросов\n"
            f"      — разблокирована возможность просматривать гормональные и прочие препараты\n"
        )

        QUERIES_QUESTIONS = (
            "🔎 <b>Запросы: Вопросы по фарме</b>\n\n"
            ""
        )
        QUERIES_PHARMA = (
            "🔎 <b>Запросы: Рекомендации по препаратам</b>\n\n"
            ""
        )
        QUERIES_DRUG_SEARCH = (
            "🔎 <b>Запросы: Поиск препаратов</b>\n\n"
            "Введите название препарата на русском или английском, включая сленговые названия.\n\n"
            "<b>Примеры запросов:</b>\n"
            "— «Аспирин» или «Aspirin»\n"
            "— «Метформин 500»\n"
            "— «Витамин D3»\n"
            "— «Ноопепт» или «Фенибут»\n\n"
            "<i>Бот покажет полную информацию о препарате: дозировки, механизм действия, аналоги, исследования и т.д.</i>"
        )  # TODO: скриншот или видео

        TOKENS_FREE = (
            "🔎 <b>Как получать токены?</b>\n\n"
            f"<blockquote>"
            f"Если у вас есть подписка, вы будете получать токены каждый день.\n"
            f"<i> — подробнее в разделе «Подписка»</i>\n\n\n"
            f"При регистрации вам начисляется:\n"
            f"  — {SEARCH_TOKENS_START} токена базы.\n"
            f"  — {ASSISTANT_TOKENS_START} фарм токен.\n\n"
            f"</blockquote>\n\n"
            f"<u>Бесплатно токены можно получить здесь:</u>\n\n"
            f"/referrals — Реферальная система, поощряющая токенами за приглашения к боту\n\n"
            f"/free_tokens — Разово получить токены за подписку на каналы"
        )

        help_format_by_mode = {
            HelpSectionMode.MAIN: MAIN,
            HelpSectionMode.QUERIES: QUERIES,
            HelpSectionMode.TOKENS: TOKENS,
            HelpSectionMode.SUBSCRIPTION: SUBSCRIPTION,
            HelpSectionMode.QUERIES_QUESTIONS: QUERIES_QUESTIONS,
            HelpSectionMode.QUERIES_PHARMA_QUESTIONS: QUERIES_PHARMA,
            HelpSectionMode.QUERIES_DRUG_SEARCH: QUERIES_DRUG_SEARCH,
            HelpSectionMode.TOKENS_FREE: TOKENS_FREE,
        }

    # [ DRUGS ]
    DRUG_UPDATE_INFO: str = MessageTemplates.DRUG_UPDATE_INFO
    DRUG_BUY_REQUEST: str = MessageTemplates.DRUG_BUY_REQUEST
    DRUG_BUY_ALLOWED: str = MessageTemplates.DRUG_BUY_ALLOWED

    # [ positive / neutral ]
    DRUG_MANUAL_SEARCHING: str = "Поиск препарата.."

    DRUG_BUY_CREATED: str = "⏳ <i>Препарат создаётся...</i>"

    DRUG_UPDATING: str = "Препарат поставлен в очередь на обновление. Вы получите уведомление о завершении!"

    DRUG_BUY_QUEUED: str = "Данный препарат уже создаётся, попробуйте запрос через минуту."

    # [ negative ]
    DRUG_IS_BANNED: str = (
        "К сожалению, распространять информацию про нелегальные препараты запрещено законами РФ. "
        "Запрос отклонён."
    )

    DRUG_IS_NOT_EXIST: str = ("Такой препарат не существует. "
                              "Возможно, вы ошиблись в написании названия. "
                              "Попробуйте написать действующее вещество.")

    ERROR_DRUG: str = "Произошла ошибка, такой препарат не существует.."

    NOT_EXIST_DRUG: str = "Такого препарата не существует."

    # [ TOKENS ]
    NO_TOKENS: str = "У вас не осталось токенов."

    NOT_ENOUGH_UPDATE_TOKENS: str = "У вас недостаточно токенов базы для обновления препарата"

    NOT_ENOUGH_CREATE_TOKENS: str = (
        "У вас недостаточно токенов базы для покупки.\n\n"
        "Пополнить: /tokens"  # TODO INLINE
    )

    NOT_ENOUGH_QUESTION_TOKENS: str = (
        "У вас недостаточно фарм токенов для этого запроса.\n\n"
        "Пополнить: /tokens"  # TODO INLINE
    )

    NEED_SUBSCRIPTION: str = (
        "Для просмотра сомнительных препаратов необходима премиум подписка.\n\n"
        "Оформить подписку: /subscription"  # TODO INLINE
    )

    NEED_SUBSCRIPTION_FOR_UPDATE: str = (
        "Для обновления сомнительных препаратов необходима премиум подписка.\n\n"
        "Оформить подписку: /subscription"  # TODO INLINE
    )

    # [ STATIC ]
    HELLO: str = "💊 Привет! Напиши любой препарат, а я тебе пришлю его характеристику."

    # [ Mailing ]
    ONLY_FOR_ADMINS = "Эта команда доступна только для администрации."
    SUCCESS_MAILING = "Рассылка передана брокеру задач.."

    # [ QUERY ]
    QUERY_IN_PROCESS: str = "Обработка запроса..."
    ASSISTANT_WAITING: str = "Ожидание ответа на вопрос у ассистента.."

    ANTISPAM_MESSAGE = MessageTemplates.ANTISPAM_MESSAGE

    MESSAGE_LENGTH_EXCEED = MessageTemplates.MESSAGE_LENGTH_EXCEED
    MESSAGE_LENGTH_EXCEED_PREMIUM = "⚠️ Вы превысили количество символов в сообщении!"
